app/Models/ModelSekolah.php

SELECT *
FROM `tbl_sekolah`
JOIN `tbl_jenjang` ON `tbl_jenjang`.`id_jenjang` = `tbl_sekolah`.`id_jenjang`
JOIN `tbl_akreditasi` ON `tbl_akreditasi`.`id_akreditasi` = `tbl_sekolah`.`id_akreditasi`
JOIN `tbl_provinsi` ON `tbl_provinsi`.`id_provinsi` = `tbl_sekolah`.`id_provinsi`
JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten` = `tbl_sekolah`.`id_kabupaten`
JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kecamatan` = `tbl_sekolah`.`id_kecamatan`
JOIN `tbl_kelurahan` ON `tbl_kelurahan`.`id_kelurahan` = `tbl_sekolah`.`id_kelurahan`
WHERE `stat_appv` = '1'
---
    function callSekolah($id_sekolah = false)
    {
        if ($id_sekolah === false) {
            // return $this->db->table('tbl_sekolah')
            //     ->join('tbl_jenjang', 'tbl_jenjang.id_jenjang = tbl_sekolah.id_jenjang')
            //     ->join('tbl_akreditasi', 'tbl_akreditasi.id_akreditasi = tbl_sekolah.id_akreditasi')
            //     ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi = tbl_sekolah.id_provinsi')
            //     ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten = tbl_sekolah.id_kabupaten')
            //     ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan = tbl_sekolah.id_kecamatan')
            //     ->join('tbl_kelurahan', 'tbl_kelurahan.id_kelurahan = tbl_sekolah.id_kelurahan')
            //     ->get(); //select all data

            return $this->db->table('tbl_sekolah')
                ->join('tbl_jenjang', 'tbl_jenjang.id_jenjang = tbl_sekolah.id_jenjang')
                ->join('tbl_akreditasi', 'tbl_akreditasi.id_akreditasi = tbl_sekolah.id_akreditasi')
                ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi = tbl_sekolah.id_provinsi')
                ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten = tbl_sekolah.id_kabupaten')
                ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan = tbl_sekolah.id_kecamatan')
                ->join('tbl_kelurahan', 'tbl_kelurahan.id_kelurahan = tbl_sekolah.id_kelurahan')
                ->getWhere(['stat_appv' => '1']); //select data of stat_appv=>1

SELECT *
FROM `tbl_sekolah`
JOIN `tbl_jenjang` ON `tbl_jenjang`.`id_jenjang` = `tbl_sekolah`.`id_jenjang`
JOIN `tbl_akreditasi` ON `tbl_akreditasi`.`id_akreditasi` = `tbl_sekolah`.`id_akreditasi`
JOIN `tbl_provinsi` ON `tbl_provinsi`.`id_provinsi` = `tbl_sekolah`.`id_provinsi`
JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten` = `tbl_sekolah`.`id_kabupaten`
JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kecamatan` = `tbl_sekolah`.`id_kecamatan`
JOIN `tbl_kelurahan` ON `tbl_kelurahan`.`id_kelurahan` = `tbl_sekolah`.`id_kelurahan`
WHERE `stat_appv` = '0'
---
    function callSekolahPend($id_sekolah = false)
    {
        if ($id_sekolah === false) {
            return $this->db->table('tbl_sekolah')
                ->join('tbl_jenjang', 'tbl_jenjang.id_jenjang = tbl_sekolah.id_jenjang')
                ->join('tbl_akreditasi', 'tbl_akreditasi.id_akreditasi = tbl_sekolah.id_akreditasi')
                ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi = tbl_sekolah.id_provinsi')
                ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten = tbl_sekolah.id_kabupaten')
                ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan = tbl_sekolah.id_kecamatan')
                ->join('tbl_kelurahan', 'tbl_kelurahan.id_kelurahan = tbl_sekolah.id_kelurahan')
                ->getWhere(['stat_appv' => '0']); //select data of stat_appv=>0

SELECT *
FROM `tbl_jenjang`
ORDER BY `id_jenjang` ASC
---
    public function allJenjang()
    {
        return $this->db->table('tbl_jenjang')->orderBy('id_jenjang', 'ASC')->get()->getResultArray();

SELECT *
FROM `tbl_akreditasi`
ORDER BY `id_akreditasi` ASC
---
    public function allAkreditasi()
    {
        return $this->db->table('tbl_akreditasi')->orderBy('id_akreditasi', 'ASC')->get()->getResultArray();

SELECT *
FROM `tbl_provinsi`
ORDER BY `id_provinsi` ASC
---
    public function allProvinsi()
    {
        return $this->db->table('tbl_provinsi')->orderBy('id_provinsi', 'ASC')->get()->getResultArray();